gallery_iter_1/app/controllers/collections_controller.rb

SELECT "artworks".* FROM "artworks" WHERE (location = 'Mr. & Mrs. Nathan Gantcher')
---
	def index
		@type = params[:type]
		@value = params[:value]
		case @type
		when 'artist'
			@artworks = Artwork.where("creator = ?", params[:value])