app/controllers/arts_controller.rb

  def index
    @artwork=Artwork.new
    @artworks = Artwork.paginate(:page => params[:page], :per_page=>10)
---
SELECT "artworks".* FROM "artworks" LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "artworks"