app/controllers/artworks_controller.rb

SELECT "artworks".* FROM "artworks"
---
  def search
    @artworks = Artwork.search(params[:query], params[:filter], params[:order])

SELECT "artworks".* FROM "artworks"
---
  def index
    @artworks = Artwork.all

SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = 1 LIMIT 1
---
  def show
    @artwork = Artwork.find(params[:id])