app/controllers/collections_controller.rb

SELECT "artworks".* FROM "artworks" WHERE (recfrom = 'Dr. Daniel Schuman')
---
	def category
		@type = params[:type]
		@value = params[:value]

		unless type.nil?
  		dbartworks = Artwork.filter_by(params[:type], params[:value])
		else
			redirect_to ''
		end

		@artworks = dbartworks.each do |art|

SELECT "artworks".* FROM "artworks" ORDER BY creator ASC
---
	def artists
		@artists = Artwork.order('creator ASC').uniq_by{|h| h.creator}

SELECT "artworks".* FROM "artworks" ORDER BY recfrom ASC
---
	def donors
		@donors = Artwork.order('recfrom ASC').uniq_by{|h| h.recfrom}