app/controllers/exhibitions_controller.rb

SELECT "exhibitions".* FROM "exhibitions" LIMIT 20 OFFSET 0
---
  def index
    @exhibitions = Exhibition.paginate(:page => params[:page], :per_page=>20)

INSERT INTO "exhibitions" ("name", "open", "close", "description", "location", "image1", "image2", "image3", "image4", "image5", "opening", "filename", "opening_end", "created_at", "updated_at") VALUES ('Test exhibition', '2011-08-07', '2014-06-09', 'test', 'Tisch Gallery', NULL, NULL, NULL, NULL, NULL, '0001-01-01 00:00:00.000000', 'distler.png', '0001-01-01 00:00:00.000000', '2011-05-07 04:07:59.634195', '2011-05-07 04:07:59.634195')
---
  def create
    @exhibition = Exhibition.new(params[:exhibition])
    if @exhibition.save