app/controllers/tours_controller.rb

SELECT "tours".* FROM "tours"
---
  def index
    @tours = Tour.all

SELECT "tours".* FROM "tours"
SELECT "artworks".* FROM "artworks"
---
  def tour_items
    @tour_item = TourItem.new
    @tours = Tour.all
    @artworks = Artwork.all

SELECT "tours".* FROM "tours" WHERE "tours"."id" = 0 LIMIT 1
---
  def show
    @tour = Tour.find(params[:id])

SELECT "tour_items".* FROM "tour_items" WHERE "tour_items"."tour_id" = 1
SELECT "tours".* FROM "tours" WHERE "tours"."id" = 1 LIMIT 1
---
  def edit
    @tour = TourItem.where(:tour_id => params[:id])
    @t_name = Tour.find(params[:id]).name